Revit 2024 API
FormattedText.GetMaximumIndentLevel Method
 Returns the maximum allowed indent level
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int GetMaximumIndentLevel()
Visual Basic
Public Function GetMaximumIndentLevel As Integer
Visual C++
public:
int GetMaximumIndentLevel()
See Also
FormattedText Class
Autodesk.Revit.DB Namespace